cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"

# Essentials
# ===

brew "mas"
brew "duti"

# brew "git" # Git shipped with MacOS is good and modern enough
brew "git-extras"
brew "hh"
brew "htop"
brew "thefuck"
brew "mtr"
brew "nmap"
brew "watchman"
brew "wget"
brew "wireshark", link: false
brew "vault"
brew "direnv"

brew "imagemagick"
brew "imageoptim-cli"

brwe "terraform"
brew "kubectl" # TODO: Check if already installed by Docker
brew "kubernetes-helm"
cask "google-cloud-sdk"

brew "mongodb"
brew "redis"

# brew "node" # I manage node via nvm
brew "nvm"
brew "python3"
brew "yarn"

cask "swiftdefaultappsprefpane"

# Quicklook plugins
# ===
brew "qlcolorcode" # Source code with syntax highlighting
brew "qlstephen" # Plain text without or with unknown file extension
brew "qlmarkdown"
brew "quicklook-json"
brew "qlimagesize"
brew "webpquicklook"
brew "suspicious-package" # Contents of a standard Apple installer package
brew "quicklookase" # Adobe ASE Color Swatches
brew "qlvideo"
# TODO: https://github.com/jaketmp/ePub-quicklook

cask "hyper"
cask "dropbox"
cask "keyboard-maestro"
cask "docker"
cask "ngrok"
cask "keybase"
cask "1password"
cask "karabiner-elements"
mas "NordVPN", id: 1116599239
cask "forticlient"
cask "hyperswitch"
cask "alfred"
cask "appcleaner"
mas "Moom", id: 419330170
mas "PopClip", id: 445189367
mas "Monosnap", id: 540348655
cask "Marked"
mas "Apple Configurator 2", id: 1037126344
mas "Amphetamine", id: 937984704
cask "transmission"
cask "imageoptim"
brew "handbrake"
cask "postman"
cask "aerial"
cask "google-backup-and-sync"
cask "keycastr"
cask "mousepose"
cask "shortcutdetective"
cask "screenflow"
cask slack
cask "caprine"
cask "google-chrome"
cask "caskroom/versions/google-chrome-canary"
cask "firefox"
cask "opera"
cask "brave"
cask "torbrowser"
cask "notion"
cask "foldingtext"
cask "skype"
mas "Table Tool", id: 1122008420
mas "Keynote", id: 409183694
cask "sketch"
cask "sourcetree"
cask "gitup"
# cask "jetbrains-toolbox" # nope nope nope, lost patience with this piece of crap
cask "webstorm"
cask "pycharm"
cask "datagrip"
cask "visual-studio-code"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
cask "virtualBox"
cask "charles"
mas "Movist", id: 461788075
cask "vlc"
cask "caption"
cask "boxer"

cask "caskroom/fonts/font-open-sans"
cask "caskroom/fonts/font-roboto"

cask "caskroom/fonts/font-hack"
cask "caskroom/fonts/font-roboto-mono"
cask "caskroom/fonts/font-source-code-pro"
