cask_args appdir: "/Applications"
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "caskroom/cask"

# Essentials
# ===

brew "mas"
brew "duti"

# brew "git" # Git shipped with MacOS is good and modern enough
brew "git-extras"
brew "hh"
brew "htop"
brew "thefuck"
brew "mtr"
brew "nmap"
brew "watchman"
brew "wget"
brew "wireshark", link: false
brew "vault"
brew "direnv"

brew "imagemagick"
brew "imageoptim-cli"

brwe "terraform"
brew "kubectl" # TODO: Check if already installed by Docker
brew "kubernetes-helm"
cask "google-cloud-sdk"

brew "mongodb"
brew "redis"

# brew "node" # I manage node via nvm
brew "nvm"
brew "python3"
brew "yarn"

cask "swiftdefaultappsprefpane"
cask "zoomus"

# Quicklook plugins
# ===
brew "qlcolorcode" # Source code with syntax highlighting
brew "qlstephen" # Plain text without or with unknown file extension
brew "qlmarkdown"
brew "quicklook-json"
brew "qlimagesize"
brew "webpquicklook"
brew "suspicious-package" # Contents of a standard Apple installer package
brew "quicklookase" # Adobe ASE Color Swatches
brew "qlvideo"
# TODO: https://github.com/jaketmp/ePub-quicklook

{{{ apps }}}

{{{ fonts }}}
